# Connect to the Database

In [1]:
%load_ext sql 

%config SqlMagic.displaylimit = 8

In [2]:
%sql postgresql://postgres:12345@localhost:5432/postgres

Connecting to 'postgresql://postgres:***@localhost:5432/postgres'

In [3]:
%sql SELECT version()

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+-------------------------------------------------------------------------+
|                                 version                                 |
+-------------------------------------------------------------------------+
| PostgreSQL 18.1 on x86_64-windows, compiled by msvc-19.44.35221, 64-bit |
+-------------------------------------------------------------------------+

In [4]:
# set search path
%sql SET search_path TO classicmodels, public

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

++
||
++
++

# Challenge Exercises: Advanced Subqueries and Derived Tables

These exercises combine multiple concepts from subqueries and derived tables to solve more complex business questions.

### 1. Above-Average Order Value Customers
Write a query to find customers whose average order value is greater than the overall average order value across all orders. Display customer number, customer name, and their average order value. Use a derived table to calculate order values.

> หาลูกค้าที่มี average order value มากกว่าค่าเฉลี่ยทั้งหมด

In [5]:
%%sql

select c.customernumber, c.customername,od.avgordervalue
from customers c
left join
(select o.customernumber, avg(d.quantityordered * d.priceeach) as avgordervalue
from orders o left join orderdetails d on o.ordernumber = d.ordernumber
group by customernumber) od
on od.customernumber = c.customernumber
where od.avgordervalue > (select avg(quantityordered * priceeach) from orderdetails)

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

46 rows affected.

+----------------+------------------------------+-----------------------+
| customernumber |         customername         |     avgordervalue     |
+----------------+------------------------------+-----------------------+
|      114       |  Australian Collectors, Co.  | 3283.3649090909090909 |
|      121       |      Baane Mini Imports      | 3257.0246875000000000 |
|      124       | Mini Gifts Distributors Ltd. | 3287.9296666666666667 |
|      128       |     Blauer See Auto, Co.     | 3451.7163636363636364 |
|      144       |   Volvo Model Replicas, Co   | 3510.2536842105263158 |
|      145       |   Danish Wholesale Imports   | 3585.6977777777777778 |
|      148       |   Dragon Souveniers, Ltd.    | 3633.7448837209302326 |
|      151       |      Muscle Machine Inc      | 3706.5406250000000000 |
+----------------+------------------------------+-----------------------+
Truncated to displaylimit of 8.

### 2. Top Performing Product Lines
Write a query to find product lines whose total revenue exceeds the average revenue per product line. Display the product line name and total revenue. Use a subquery in FROM clause to calculate revenue per product line, and a single-row subquery to find the average.

> หา product lines ที่มี revenue เกินค่าเฉลี่ย

In [6]:
%%sql

select a.productline, a.totalrevenue
from
(select pl.productline,
sum(od.quantityordered * od.priceeach) as totalrevenue
from productlines pl
left join products p on p.productline = pl.productline
left join orderdetails od on p.productcode = od.productcode
group by pl.productline) a
where a.totalrevenue >
(
select avg(totalrevenue)
from (select pl2.productline,
sum(od2.quantityordered * od2.priceeach) as totalrevenue
from productlines pl2
left join products p2 on p2.productline = pl2.productline
left join orderdetails od2 on p2.productcode = od2.productcode
group by pl2.productline) b
)

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

2 rows affected.

+--------------+--------------+
| productline  | totalrevenue |
+--------------+--------------+
| Classic Cars |  3853922.49  |
| Vintage Cars |  1797559.63  |
+--------------+--------------+

### 3. Offices with High-Value Employee Performance
Write a query to find offices where the total number of customers handled by all employees in that office is greater than the average number of customers per office. Display office code, city, and total customer count.

> หา offices ที่มีจำนวนลูกค้ามากกว่าค่าเฉลี่ยต่อ office

In [7]:
%%sql

SELECT a.officecode, a.city, a.totalcustomer
FROM (
SELECT o2.officecode, o2.city, COUNT(c2.customernumber) AS totalcustomer
FROM employees e2
LEFT JOIN customers c2 ON e2.employeenumber = c2.salesrepemployeenumber
LEFT JOIN offices o2 ON e2.officecode = o2.officecode
GROUP BY o2.officecode, o2.city
) a
WHERE a.totalcustomer >
(SELECT AVG(countcustomer)
FROM (
SELECT COUNT(c3.customernumber) AS countcustomer
FROM employees e3
LEFT JOIN customers c3 ON e3.employeenumber = c3.salesrepemployeenumber
LEFT JOIN offices o3 ON e3.officecode = o3.officecode
GROUP BY o3.officecode) b
);

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

3 rows affected.

+------------+--------+---------------+
| officecode |  city  | totalcustomer |
+------------+--------+---------------+
|     4      | Paris  |       29      |
|     7      | London |       17      |
|     3      |  NYC   |       15      |
+------------+--------+---------------+

### 4. Premium Orders Comparison
Write a query to find orders that have more order line items than the average number of line items per order. Display the order number, customer name, and number of line items. Use a derived table to count line items per order.

> หา orders ที่มี line items มากกว่าค่าเฉลี่ย

In [8]:
%%sql

SELECT c.customerName, oli.orderNumber, oli.itemCount
FROM customers c
JOIN orders o ON c.customerNumber = o.customerNumber
JOIN (SELECT orderNumber, COUNT(*) AS itemCount
FROM orderdetails
GROUP BY orderNumber) AS oli
ON o.orderNumber = oli.orderNumber
WHERE oli.itemCount > (SELECT AVG(itemCount)
FROM (SELECT COUNT(*) AS itemCount
FROM orderdetails
GROUP BY orderNumber) AS avgItems);

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

149 rows affected.

+---------------------------+-------------+-----------+
|        customername       | ordernumber | itemcount |
+---------------------------+-------------+-----------+
|     Baane Mini Imports    |    10103    |     16    |
|   Euro+ Shopping Channel  |    10104    |     13    |
|  Danish Wholesale Imports |    10105    |     15    |
|       Rovelli Gifts       |    10106    |     18    |
|      Cruz & Sons Co.      |    10108    |     16    |
|       AV Stores, Co.      |    10110    |     16    |
| La Corne D'abondance, Co. |    10114    |     10    |
|  Dragon Souveniers, Ltd.  |    10117    |     12    |
+---------------------------+-------------+-----------+
Truncated to displaylimit of 8.

### 5. Product Sales Above Company Average
Write a query to find products whose total quantity sold is greater than the average total quantity sold per product. Display product code, product name, and total quantity sold. Use a derived table to calculate total quantities per product.

> หา products ที่มีจำนวนสินค้าที่ขายได้มากกว่าค่าเฉลี่ยต่อ product

In [9]:
%%sql

SELECT p.productCode, p.productName, ps.totalQty
FROM products p
JOIN (SELECT productCode, SUM(quantityOrdered) AS totalQty
FROM orderdetails
GROUP BY productCode) AS ps
ON p.productCode = ps.productCode
WHERE ps.totalQty > (SELECT AVG(totalQty)
FROM (SELECT SUM(quantityOrdered) AS totalQty
FROM orderdetails
GROUP BY productCode) AS avgQty);

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

51 rows affected.

+-------------+---------------------------------------+----------+
| productcode |              productname              | totalqty |
+-------------+---------------------------------------+----------+
|   S10_1678  | 1969 Harley Davidson Ultimate Chopper |   1057   |
|   S10_2016  |         1996 Moto Guzzi 1100i         |   999    |
|   S10_4698  |  2003 Harley-Davidson Eagle Drag Bike |   985    |
|   S10_4757  |          1972 Alfa Romeo GTA          |   1030   |
|   S12_1108  |           2001 Ferrari Enzo           |   1019   |
|   S12_1666  |             1958 Setra Bus            |   972    |
|   S12_2823  |            2002 Suzuki XREO           |   1028   |
|   S12_4473  |           1957 Chevy Pickup           |   1056   |
+-------------+---------------------------------------+----------+
Truncated to displaylimit of 8.